#week4作业

#词典；每个词后方存储的是其词频，词频仅为示例，不会用到，也可自行修改
Dict = {"经常":0.1,
        "经":0.05,
        "有":0.1,
        "常":0.001,
        "有意见":0.1,
        "歧":0.001,
        "意见":0.2,
        "分歧":0.2,
        "见":0.05,
        "意":0.05,
        "见分歧":0.05,
        "分":0.1}

#待切分文本
sentence = "经常有意见分歧"

#实现全切分函数，输出根据字典能够切分出的所有的切分方式
def all_cut(sentence, Dict):
    target=[]
    def backtrack(start, path):
        if start==len(sentence):#如果已经切分完毕，则将路径加入结果
            target.append(path[:])
            return
        for end in range(start + 1, len(sentence) + 1):#枚举所有可能的切分位置
            word=sentence[start:end]#切分出的词
            if word in Dict:#如果词在字典中，则继续切分
                path.append(word) #将词加入路径
                backtrack(end, path) #递归调用，继续切分剩余部分
                path.pop()#回溯，移除最后一个词
    backtrack(0, [])
    return target

#目标输出;顺序不重要
target = [
    ['经常', '有意见', '分歧'],
    ['经常', '有意见', '分', '歧'],
    ['经常', '有', '意见', '分歧'],
    ['经常', '有', '意见', '分', '歧'],
    ['经常', '有', '意', '见分歧'],
    ['经常', '有', '意', '见', '分歧'],
    ['经常', '有', '意', '见', '分', '歧'],
    ['经', '常', '有意见', '分歧'],
    ['经', '常', '有意见', '分', '歧'],
    ['经', '常', '有', '意见', '分歧'],
    ['经', '常', '有', '意见', '分', '歧'],
    ['经', '常', '有', '意', '见分歧'],
    ['经', '常', '有', '意', '见', '分歧'],
    ['经', '常', '有', '意', '见', '分', '歧']
]

result = all_cut(sentence, Dict)
for r in result:
  print(r)
#import jieba

#print(jieba.lcut("自来水来自上海"))
