#week3作业

#词典；每个词后方存储的是其词频，词频仅为示例，不会用到，也可自行修改
Dict = {"经常":0.1,
        "经":0.05,
        "有":0.1,
        "常":0.001,
        "有意见":0.1,
        "歧":0.001,
        "意见":0.2,
        "分歧":0.2,
        "见":0.05,
        "意":0.05,
        "见分歧":0.05,
        "分":0.1}

#待切分文本
sentence = "经常有意见分歧"

#实现全切分函数，输出根据字典能够切分出的所有的切分方式
def all_cut(sentence, Dict):
    def dfs(s, path, target):
        if not s:
            target.append(path[:]) #將當前路徑加入目標列表
            return
        
        for i in range(1, len(s) + 1): #遍歷所有可能的切分點
            word = s[:i] #當前切分點
            if word in Dict: #如果當前切分點在字典中
                path.append(word) #將當前切分點加入路徑
                dfs(s[i:], path, target)
                path.pop() # 回溯
                
    target = []
    dfs(sentence, [], target)
    return target

#目标输出;顺序不重要
target = [
    ['经常', '有意见', '分歧'],
    ['经常', '有意见', '分', '歧'],
    ['经常', '有', '意见', '分歧'],
    ['经常', '有', '意见', '分', '歧'],
    ['经常', '有', '意', '见分歧'],
    ['经常', '有', '意', '见', '分歧'],
    ['经常', '有', '意', '见', '分', '歧'],
    ['经', '常', '有意见', '分歧'],
    ['经', '常', '有意见', '分', '歧'],
    ['经', '常', '有', '意见', '分歧'],
    ['经', '常', '有', '意见', '分', '歧'],
    ['经', '常', '有', '意', '见分歧'],
    ['经', '常', '有', '意', '见', '分歧'],
    ['经', '常', '有', '意', '见', '分', '歧']
]

# if __name__ == "__main__":
#     sentence = "经常有意见分歧"
#     target = all_cut(sentence, Dict)
#     for path in target:
#         print(" / ".join(path))